{
  "newsList": [
    {
      "id": 1,
      "title": "[냥냥 식당 타이쿤] 다음 업데이트 일정 변경 및 현황 안내",
      "content": "사랑스러운 '냥냥 식당 타이쿤'의 유저분들께,\\n\\n안녕하세요, 냥냥 식당 타이쿤 개발팀입니다.\\n\\n저희 게임에 대한 변함없는 사랑과 깊은 관심에 진심으로 감사드립니다. 먼저, 애타게 기다려주신 다음 업데이트 일정에 관하여 변경 사항을 알려드리게 되어 송구스러운 마음뿐입니다.\\n\\n당초 11월 20일로 예정되었던 다음 업데이트는, 게임의 완성도와 유저분들의 더욱 쾌적한 플레이 경험을 위해 일정이 연기되어 12월 24일, 따뜻한 크리스마스 특별 이벤트와 함께 찾아뵐 예정입니다. 🎄\\n\\n업데이트 지연이라는 소식에 많이 실망하셨을 유저분들을 생각하며 무척 송구합니다. 하지만 더 좋은 게임으로 보답하고자 저희 개발팀은 아래와 같은 중요 문제점들을 해결하는 데 총력을 기울이고 있습니다.\\n\\n---\\n\\n### 현재 개발팀에서 해결 중인 주요 문제점 (12월 24일 업데이트 목표)\\n\\n저희는 현재 유저분들의 몰입감 있는 게임 플레이에 영향을 미치는 아래와 같은 버그들을 파악하고 수정 작업에 매진하고 있습니다.\\n\\n*   [유저 인터페이스(UI) 관련 문제]\\n    *   모바일 보상 화면 UI 이상: 보상 획득 시 UI가 의도와 다르게 표시되던 문제\\n    *   메가박스 관련 UI 표시 오류: 메가박스 개봉 시 이미지가 보이지 않거나, 다른 이미지 조각이 섞여 나타나던 현상\\n    *   호감도 수치 표시 오류: 보상으로 획득한 호감도 수치가 소수점 여섯 자리까지 비정상적으로 길게 표시되던 문제\\n    *   간헐적 UI 반응 오류: 특정 UI 오브젝트(예: 레시피북)를 처음 클릭할 때 여러 번 눌러야 반응하거나, 게임 동작이 일시적으로 멈추던 현상\\n\\n*   [PC 버전 플레이 경험 문제]\\n    *   UI 스케일 및 창 크기 문제: PC 환경에서 UI 크기가 부적절하고, 게임 창을 닫기 어렵던 문제\\n    *   카메라 제어 불가: PC에서 마우스로 카메라 이동 및 확대/축소가 불가능하여 게임 시점 조절이 어려웠던 문제\\n    *   카메라 초기 위치 오류: 게임 첫 시작 시 카메라가 엉뚱한 곳에 놓여있어 시야 확보가 불편했던 문제\\n\\n*   [게임 시스템 및 안정성 문제]\\n    *   손님 AI 질서 문제: 보상으로 손님이 대량 등장 시, 주문 대기열에서 손님들 간의 질서가 지켜지지 않던 문제\\n    *   특정 기기 성능 저하: 특정 모바일 기기에서 특정 행동 시 게임이 일시적으로 멈추거나 딜레이가 발생하는 현상\\n\\n---\\n\\n위 목록 외에도 유저분들의 원활한 게임 플레이를 저해하는 여러 사소한 문제점들을 꼼꼼하게 검수하고 수정하는 중입니다. 모든 버그를 완전히 해결하여, 유저분들께서 더욱 몰입하고 즐거운 경험을 하실 수 있도록 마지막까지 최선을 다하겠습니다.\\n\\n조금만 더 기다려주시면, 12월 24일에는 크리스마스의 기쁨과 함께 더욱 완성도 높고 안정적인 '냥냥 식당 타이쿤'을 만나실 수 있도록 노력하겠습니다. 유저분들의 넓은 이해와 많은 응원 부탁드립니다.\\n\\n감사합니다.\\n\\n**- 냥냥 식당 타이쿤 개발팀 드림 -**",
      "date": "2025-11-09",
      "game": "nyangnyang"
    },
    {
      "id": 2,
      "title": "[냥냥 식당 타이쿤] 서비스 종료 안내",
      "content": "사랑스러운 '냥냥 식당 타이쿤'의 유저분들께,\\n\\n안녕하세요, 냥냥 식당 타이쿤 개발팀입니다.\\n\\n 저희 게임에 대한 변함없는 사랑과 깊은 관심에 진심으로 감사드립니다. 하지만 냥냥식당타이쿤은 이시간 후로 서비스가 종료됩니다.\\n다시 한번 냥냥식당타이쿤을 사랑해주셔서 감사합니다.",
      "date": "2025-12-07",
      "game": "nyangnyang"
    },
    {
      "id": 3,
      "title": "웹 서버 섭종 안내",
      "content": "기술적인 문제로 웹이 12월 17일 이후로 접속이 불가능해 섭종할 예정입니다. \\n 곧 신규 웹으로 찾아뵙겠습니다. \\n 대단히 죄송합니다.",
      "date": "2025-12-07",
      "game": "announcement"
    },
    {
      "id": 4,
      "title": "[냥냥 식당 타이쿤] 서비스 종료 취소 안내",
      "content": "사랑스러운 '냥냥 식당 타이쿤'의 유저분들께,\\n\\n안녕하세요, 냥냥 식당 타이쿤 개발팀입니다.\\n\\n 저희 게임에 대한 변함없는 사랑과 깊은 관심에 진심으로 감사드립니다. 하지만 냥냥식당타이쿤은 이시간 후로 서비스가 종료되었을 예정이었으나 다시 한번 도전해볼려고 합니다. \\n다시 한번 냥냥식당타이쿤을 사랑해주셔서 감사합니다. \\n\\n\\n --냥냥식당타이쿤 총괄 매니저--",
      "date": "2025-12-09",
      "game": "nyangnyang"
    },
    {
      "id": 5,
      "title": "웹 서버 섭종 중지 안내",
      "content": "기술적인 문제로 웹이 12월 17일 이후로 접속이 불가능해 섭종할 예정이었으나 기술적인 문제 해결로 12월 25일 부터 다시 업데이트가 주기적인 웹을 만나실 수 있습니다. \\n 기다려 주셔서 감사합니다. \\n\\n -지후컴퍼니-",
      "date": "2025-12-24",
      "game": "announcement"
    },
    {
      "id": 6,
      "title": "냥냥식당타이쿤 2026 로드맵",
      "content": "사랑스러운 '냥냥 식당 타이쿤'의 유저분들께,\\n\\n안녕하세요, 냥냥 식당 타이쿤 개발팀입니다.\\n\\n 저희 게임에 대한 변함없는 사랑과 깊은 관심에 진심으로 감사드립니다. \\n 이번엔 냥냥식당타이쿤 2026 로드맵에 대해서 말씀드리겠습니다. \\n\\n 1. 다음 업데이트는 2026년 2월 초입니다. 앞으로도 남은 시간동안 열심히 만들어 오겠습니다. 모든 플레이어는 업데이트 후 데이터 초기화가 예상 되기에 상점에서 무료 식당상자 5개랑 기타 재화 여러개를 획득할 수 있습니다. \\n 또한 스포를 하자면 게임슬롯 시스템과, 장비 상점이 등장하며 냥이드롭이 등장합니다. \\n\\n 2. 그 다음 업데이트는 5월 이후에 등장하며 소규모 업데이트일 예정입니다. 추가 소식이 생기면 이 밑에 적어놓겠습니다! \\n *****추가 사항***** \\n\\n\\n3. 그 다음 업데이트는 언제 나올 지 모르겠으나 대략 8월 쯤 등장합니다. 이 버전은 중규모 정도 수준일 것이며 추가 소식이 생기면 이 밑에 적어놓겠습니다! \\n *****추가 사항***** \\n\\n\\n 4. 그 다음 업데이트는 12월에 있을 것이며 대규모일 예정이며 마찬가지로 추가 소식이 생기면 이 밑에 적어놓겠습니다! \\n *****추가 사항***** \\n\\n\\n 지금까지 냥냥식당타이쿤 2026로드맵이었습니다. 앞으로도 많은 소식 기다려주세요. \\n\\n\\n --냥냥식당타이쿤 총괄 책임자-",
      "date": "2026-01-08",
      "game": "nyangnyang"
    }.
  ]
}
